# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и dict.
month_List_S = ["Зима", "Весна", "Лето", "Осень", "Зима"]
months_S = {1: "Зима", 2: "Зима",
            3: "Весна", 4: "Весна", 5: "Весна",
            6: "Лето", 7: "Лето", 8: "Лето",
            9: "Осень", 10: "Осень", 11: "Осень",
            12: "Зима"}
while True:
    Month = int(input("Введите месяц (цифра от 1 до 12): "))
    if Month > 0 and Month <13:
        break
    else:
        continue
print(f"Месяц {Month} это {months_S[Month]}")
print(f"Месяц {Month} это {month_List_S[(Month)//3]}")